/**
 * @file main.cpp
 * @author Captain Kitty Cat (youtube.com/@captainkittyca2)
 * @brief Adds three masks, 3-day cycle, ISG, and more mechanics from Majora's Mask onto TP
 * @version 0.6.1
 * @date 2026-01-19
 *
 * @copyright Copyright (c) 2026
 *
 */
#include <display/console.h>     // Contains a very neat helper class to print to the console
#include <main.h>
#include <patch.h>     // Contains code for hooking into a function
#include <cstdio>
#include <tp/f_ap_game.h>
#include <tp/d_meter2.h>
#include <tp/d_meter_HIO.h>
#include <tp/d_com_inf_game.h>
#include <tp/m_do_audio.h>
#include <tp/d_menu_window.h>
#include <tp/JFWSystem.h>
#include <tp/processor.h>
#include <tp/JKRArchivePub.h>
#include <string.h>
#include <tp/rel/ids.h>
#include <tp/d_meter2_info.h>
#include <tp/d_bomb.h>
#include <gc_wii/OS.h>
#include <gc_wii/OSCache.h>
#include <gc_wii/OSTime.h>
#include <tp/d_item.h>
#include <JSystem/JMath/JMATrigonometric.h>

#ifdef PLATFORM_WII
#include <tp/m_re_controller_pad.h>
#else
#include <tp/m_do_controller_pad.h>
#endif

#define MSG_COLOR(id) "\x1A\x06\xFF\x00\x00" id
#define MSG_COLOR_UNK "\x00"
#define MSG_COLOR_RED "\x01"
#define MSG_COLOR_YELLOW "\x04"

namespace mod
{
    Mod* gMod = nullptr;

    void main()
    {
        Mod* mod = new Mod();
        mod->init();
    }

    void exit() {}

    Mod::Mod(): c( 0 )
    {
    }
    daMidna_checkMetamorphoseEnableBase_Def daMidna_c__checkMetamorphoseEnableBase = nullptr;
    //daE_fz_actionModeSet return_e_fz_actionModeSet = nullptr;
#ifndef PLATFORM_WII
    daA_arrow_execute return_a_arrow_execute = nullptr;
    daE_db_action return_e_db_action = nullptr;
    daE_dn_action return_e_dn_action = nullptr;
    daE_kk_actionModeSet return_e_kk_actionModeSet = nullptr;
    daE_kr_action return_e_kr_action = nullptr;
    daE_rd_action return_e_rd_action = nullptr;
    uint16_t bs_e_address[2] = {0x744, 0x768};
    uint16_t bu_e_address = 0x658;
    uint16_t db_e_address[2] = {0x6B8, 0x504C};
    uint16_t dd_e_address = 0x6E0;
#else
    uint16_t bs_e_address[2] = {0x698, 0x6BC};
    uint16_t bu_e_address = 0x8C0;
    uint16_t db_e_address[1] = {0x9B0};
    uint16_t dd_e_address = 0x930;
#endif
    daE_ww_actionModeSet return_e_ww_actionModeSet = nullptr;
    daNPC_impaa_execute return_npc_impaa_execute = nullptr;
    daE_oc_actionModeSet return_e_oc_actionModeSet = nullptr;
    daE_tt_actionModeSet return_e_tt_actionModeSet = nullptr;
    daE_ai_action return_e_ai_action = nullptr;
    daE_mm_action return_e_mm_action = nullptr;
    daE_sf_action return_e_sf_action = nullptr;
    daE_bu_attack return_e_bu_attack = nullptr;
    //daB_bh_execute return_b_bh_execute = nullptr;
    libtp::tp::jfw_system::SystemConsole* sysConsolePtr = libtp::tp::jfw_system::systemConsole;

    uint32_t readIconsTex = reinterpret_cast<uint32_t>(libtp::tp::d_meter2_info::readItemTexture);
    uint32_t bButtonDimm = reinterpret_cast<uint32_t>(libtp::tp::d_meter2_draw::setButtonIconBAlpha);
    uint32_t zButtonDimm = reinterpret_cast<uint32_t>(libtp::tp::d_meter2_draw::setButtonIconMidonaAlpha);
    uint32_t activeASMPatchingLOL = reinterpret_cast<uint32_t>(libtp::tp::d_menu_ring::setActiveCursor);
    uint32_t itemASMPatchLOOL = reinterpret_cast<uint32_t>(libtp::tp::d_menu_ring::setItemFromItemRing);
    uint32_t selectItemForZSelect = reinterpret_cast<uint32_t>(libtp::tp::d_com_inf_game::dComIfGp_getSelectItem);
    uint32_t zNewItemChangeExamination = reinterpret_cast<uint32_t>(libtp::tp::d_a_alink::checkNewItemChange);
    uint32_t gameOverCreatee = reinterpret_cast<uint32_t>(libtp::tp::d_gameover::createGameOver);
    uint32_t gameOverTeeeeeext = reinterpret_cast<uint32_t>(libtp::tp::d_gameover::ctGameOver);
    uint32_t gameHourssss = reinterpret_cast<uint32_t>(libtp::z2audiolib::z2scenemgr::setSceneName);
    //uint32_t retry__NOPELOLOLOL = reinterpret_cast<uint32_t>(libtp::tp::d_gameover::retryQueston0);

    // Saved mod info
    struct saveInfo
    {
        /* 0x00 */ uint8_t bobombStorePlace[2];
        /* 0x02 */ uint16_t rupeeeStoreePlace;
        /* 0x04 */ uint32_t timeRecordedReferr;
        /* 0x08 */ uint8_t dPadChoice;
        /* 0x09 */ uint8_t doubleDefencee;
        /* 0x0A */ uint8_t nightOfTheee;
        /* 0x0B */ uint8_t bowwStorePlace;
        uint8_t unk[62];
        /* 0x4A */ uint8_t zButtonSloot;
        /* 0x4B */ uint8_t zButtonnItemm;
        /* 0x4C */ uint8_t maskID;
        /* 0x4D */ uint8_t MMGlitches;
        /* 0x4E */ uint8_t cycle3Days;
        /* 0x4F */ uint8_t MMMaskPack1ID;
    } __attribute__((__packed__));

    saveInfo* saveInfoPtr = reinterpret_cast<saveInfo*>(&libtp::tp::d_com_inf_game::dComIfG_gameInfo.save.save_file.reserve);

    uint8_t crouch = 0;
    bool shieldCrouch = false;
    bool maskWear = false;
    bool gameplayStatus = false;
    bool blastNope = true;
    bool dpaaadRight = false;
    bool dpaaadDown = false;
    //bool zDimOrNope = false;
    int64_t second = 0;
    int64_t counting = 0;
    uint8_t timeRemaining = 15;
    uint8_t timeUpdate = 15;
    int64_t second2 = 0;
    int64_t countinng2 = 0;
    uint8_t timeRemaininng2 = 30;
    uint8_t timeUpdaate2 = 30;

    __attribute__((used, visibility("default"))) void performStaticASMReplacement(uint32_t memoryOffset, uint32_t value)
    {
        *reinterpret_cast<uint32_t*>(memoryOffset) = value;

        // Clear the cache for the modified value
